import React from 'react';
import './Css/MainFrame.css';

const MainFrame = () => {
    return (
        <div className="home-container" id="home">
            <section className="hero-section">
                <h2>?מי אנחנו</h2>
                <p>
                        אנו פלטפורמה מתקדמת ונגישה שנועדה להחליף מערכות מיושנות בבתי החולים בישראל. 
                        מטרתה לספק פתרון למטופלים הסובלים מהפרעות ראייה בעקבות אירוע מוחי.
                        המערכת מציעה תרגולים מותאמים אישית לשיפור תפקוד שרירי העין ולחיזוק הקשרים הנוירונים במוח במטרה להאיץ את תהליך השיקום.
                        באמצעות ממשק ידידותי, משחקים אינטראקטיביים וכלי מעקב מתקדמים, המטופלים יכולים לתרגל מכל מקום ובכל זמן, המערכת מפיקה מדדים סטטיסטיים אשר יהיו נגישים לצוות הרפואי בזמן אמת.
                        באופן כללי, המערכת מציעה חוויית משתמש חדשנית וממוקדת, תוך שמירה על נגישות מלאה המתאימה למטופלים בגילאים שונים ולצרכים מגוונים.

                </p>
            </section>
            <section className="hero-section" id="features">
                <h2>יתרונות אימון הקשר של העיניים עם המוח</h2>
                <ul className="benefits-list">
                <p>.משפר את התפיסה החזותית ועיבוד הקוגניטיבי</p>
                <p>.משפר את הריכוז והפרודוקטיביות באמצעות תרגילים ממוקדים</p>
                <p>.מציע תובנות מותאמות אישית לאופטימיזציה של תיאום מוח-ראייה</p>
                <p>.מיועד לסטודנטים, מקצוענים ולומדים לכל החיים</p>
                </ul>
            </section>
        </div>
    );  
};

export default MainFrame;
